StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986VE4_GPIO.svd
    <!-- GPIO_PORTC -->
    <peripheral>
      <name>MDR_PORTC</name>
      <version>1.0</version>
      <description>GPIO Port Control</description>
      <groupName>GPIO Ports</groupName>
      <baseAddress>0x40090000</baseAddress><!--#BE4,#BK214,#BK234-->

      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <!--size>0x2C</size--><!--#BE1,#BE3,#BK214-->
        <size>0x20</size><!--#BE9x,#BE4,#BK234,#VC1-->
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <!-- RXTX -->
        <register>
          <name>RXTX</name>
          <description>GPIO Pin Data</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
              <name>Pin_%s</name>
              <description>Pin data value</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>LOW Level Voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>HIGH Level Voltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- OE -->
        <register>
          <name>OE</name>
          <description>Output Enable Control</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
              <name>Pin_%s</name>
              <description>Pin data direction</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN</name>
                  <description>Input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>Output pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- FUNC -->
        <register>
          <name>FUNC</name>
          <description>Pin Functions in Digital mode</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
              <name>Pin_%s</name>            
              <description>Pin Digital Function</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Port</name>
                  <description>RXTX defined pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Main</name>
                  <description>Main Periph defined pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Alter</name>
                  <description>Alter Periph defined pin</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Override</name>
                  <description>Override Periph defined pin</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- ANALOG -->
        <register>
          <name>ANALOG</name>
          <description>Enable Digital Mode Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
              <name>Pin_%s</name>            
              <description>Enable Digital mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Analog</name>
                  <description>Pin works with Analog signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Digital</name>
                  <description>Pin works with Digital signal</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- PULL -->
        <register>
          <name>PULL</name>
          <description>PULL Up and Down Control</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <fields>
            <field>
              <name>Down_Pin_0</name>
              <description>Pull Down Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>No pull selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWN</name>
                  <description>Pin pulled down to GND</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="Down_Pin_0"><name>Down_Pin_1</name><bitRange>[1:1]</bitRange></field>
            <field derivedFrom="Down_Pin_0"><name>Down_Pin_2</name><bitRange>[2:2]</bitRange></field>
            <field derivedFrom="Down_Pin_0"><name>Down_Pin_3</name><bitRange>[3:3]</bitRange></field>
            <field derivedFrom="Down_Pin_0"><name>Down_Pin_4</name><bitRange>[4:4]</bitRange></field>
            <field derivedFrom="Down_Pin_0"><name>Down_Pin_5</name><bitRange>[5:5]</bitRange></field>
            <field derivedFrom="Down_Pin_0"><name>Down_Pin_6</name><bitRange>[6:6]</bitRange></field>
            <field derivedFrom="Down_Pin_0"><name>Down_Pin_7</name><bitRange>[7:7]</bitRange></field>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
              <name>UP_Pin_%s</name>            
              <description>Pull Up Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>No pull selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Pin pulled up to Ucc</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- PD -->
        <register>
          <name>PD</name>
          <description>Otput Driver Mode</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <fields>
            <field>
              <name>Driver_Pin_0</name>
              <description>Driver mode for pin</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Driver</name>
                  <description>Pull-Push driver</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpenDrain</name>
                  <description>Work with line pulled up to Ucc</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="Driver_Pin_0"><name>Driver_Pin_1</name><bitRange>[1:1]</bitRange></field>
            <field derivedFrom="Driver_Pin_0"><name>Driver_Pin_2</name><bitRange>[2:2]</bitRange></field>
            <field derivedFrom="Driver_Pin_0"><name>Driver_Pin_3</name><bitRange>[3:3]</bitRange></field>
            <field derivedFrom="Driver_Pin_0"><name>Driver_Pin_4</name><bitRange>[4:4]</bitRange></field>
            <field derivedFrom="Driver_Pin_0"><name>Driver_Pin_5</name><bitRange>[5:5]</bitRange></field>
            <field derivedFrom="Driver_Pin_0"><name>Driver_Pin_6</name><bitRange>[6:6]</bitRange></field>
            <field derivedFrom="Driver_Pin_0"><name>Driver_Pin_7</name><bitRange>[7:7]</bitRange></field>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
              <name>Schmitt_Pin_%s</name>            
              <description>Schmitt trigger Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Schmitt 200mv</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Schmitt 400mv</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- PWR -->
        <register>
          <name>PWR</name>
          <description>Output voltage switch rate</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
              <name>Pin_%s</name>            
              <description>Voltage levels switch rate</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Level switch disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Slow</name>
                  <description>Levels switch rate about 100ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Fast</name>
                  <description>Levels switch rate about 20ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxFast</name>
                  <description>Levels switch rate about 10ns</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- GFEN -->
        <register>
          <name>GFEN</name>
          <description>Input pulses filter</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
              <name>Pin_%s</name>
              <description>Filter for pin</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Filter Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Filter pulses less then 10 ns</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>

    <!-- GPIO_PORTD -->
    <!--#BE1,#BE3,#BE9x,#VC1-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTD</name>
      <baseAddress>0x400C0000</baseAddress>
    </peripheral-->

    <!-- GPIO_PORTE -->
    <!--#BE1,#BE3,#BE9x,#VC1-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTE</name>
      <baseAddress>0x400C8000</baseAddress>
    </peripheral-->

    <!-- GPIO_PORTF -->
    <!--#BE1,#BE3,#BE9x,#VC1-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTF</name>
      <baseAddress>0x400E8000</baseAddress>
    </peripheral-->

    <!-- GPIO_PORTG -->
    <!--#BE3-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTG</name>
      <baseAddress>0x40118000</baseAddress>
    </peripheral-->

    <!-- GPIO_PORTH -->
    <!--#BE3-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTH</name>
      <baseAddress>0x40138000</baseAddress>
    </peripheral-->

    <!-- GPIO_PORTI -->
    <!--#BE3-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTI</name>
      <baseAddress>0x40140000</baseAddress>
    </peripheral-->


    <!-- peripherals end-->
  </peripherals>

</device>  